Table of Contents
 Class Region3D
Namespace
IdeaRS.OpenModel.Geometry3D
Assembly
IdeaRS.OpenModel.dll
Represents a region in three-dimensional space included outline (border) and openings.
[OpenModelClass("CI.Geometry3D.Region3D,CI.Geometry3D", "CI.Geometry3D.IRegion3D,CI.BasicTypes")]
public class Region3D : OpenElementId
Inheritance
object
OpenObject
OpenElementId
Region3D
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 Region3D()
Constructor
public Region3D()
Properties
 LocalCoordinateSystem
Local coordinate system
[OpenModelProperty("LCS")]
public CoordSystem LocalCoordinateSystem { get; set; }
Property Value
CoordSystem
 Openings
Gets or sets the list of references to PolyLine3Dopenning curve in the Region3D.
public List<ReferenceElement> Openings { get; set; }
Property Value
List<ReferenceElement>
 Outline
Gets or sets the reference to PolyLine3D curve of Region3D.
public ReferenceElement Outline { get; set; }
Property Value
ReferenceElement
 Edit this page